{
    "projects": [
        {
            "id": 1,
            "name": "Mark Six Lottery Numbers Generator",
            "url": "https://github.com/kendicey/mark-six-lottery-numbers-generator-REACT",
            "image": "https://github.com/kendicey/mark-six-lottery-numbers-generator-REACT/blob/main/docs/preview.png?raw=true",
            "description": "This project is a Mark Six lottery number generator, designed to assist players in generating 6 unique numbers for the popular game organized by the Hong Kong Jockey Club. Inspired by my mom's frequent requests for lucky numbers, I created this program to empower her to generate numbers independently. With this tool, players can easily and quickly generate their own sets of numbers for the Mark Six lottery game.",
            "works": ["Built a website to generate numbers for a Hong Kong lottery game with HTML, CSS, JavaScript, and React.js",
                    "Designed user interface"],
            "technologies": "React.js, JavaScript, HTML, CSS"
        },
        {
            "id": 2,
            "name": "AskAiden (currently working in private repo)",
            "url": "",
            "image": "",
            "description": "An educational search website leveraging on ChatGPT 3.5 technology.",
            "works": ["Follow a UI designer's high fidelity wireframe to build the frontend with React.js and MaterialUI",
                    "Establish the backend API connection using Python with FastAPI and the OpenAI API"],
            "technologies": "React.js, MaterialUI, JavaScript, HTML, CSS, FastAPI, OpenAI"
        },
        {
            "id": 3,
            "name": "KidsPedia",
            "url": "https://devpost.com/software/kidspedia",
            "image": "https://github.com/HSKPeter/KidsPedia/blob/main/docs/screenshot.png?raw=true",
            "description": "Leveraging on the ChatGPT technology of OpenAI, KidsPedia provides simple and easy-to-understand answers with metaphors to kids' questions. From apples to theory of relativity, KidsPedia explains them all! To enhance searching experiences, KidsPedia includes a read-out function to read out the answers to kids' questions. To speed up the search process, KidsPedia also stores search records in a database.",
            "works": ["Worked in a team of 2 to complete a web application within 24 hours in the nwHacks 2023 hackathon",
                    "Developed backend environment with Express.js and the OpenAI API",
                    "Worked on the frontend using React.js"],
            "technologies": "React.js, JavaScript, Express.js, OpenAI, PostgreSQL, Azure, Docker"
        },
        {
            "id": 4,
            "name": "Daily Mood Playlist Generator",
            "url": "https://github.com/elise-green/cmd-f-hackathon-2023",
            "image": "https://github.com/kendicey/kendicey.github.io/blob/main/src/assets/cmd_preview.png?raw=true",
            "description": "A web app let user answer the question 'How was your day today?' and returns a spotify playlist that matches user's mood.",
            "works": ["Worked in a team of 4 to complete a web application in cmd-f 2023 hackathon",
                    "Developed backend with Express.js and Cohere AI API",
                    "Built connection between React frontend and Express.js backend"],
            "technologies": "React.js, Express.js, Co:here"
        },
        {
            "id": 5,
            "name": "3380 Prairie Sky Café Online Ordering System",
            "url": "https://github.com/BenTsui2023/csis3380-final-project",
            "image": "https://github.com/BenTsui2023/csis3380-final-project/blob/main/doc/project_preview.png?raw=true",
            "description": "This project entails a MERN application designed specifically for 3380 Prairie Sky Cafe, where users are able to register an account and place orders. The system is also capable of keeping track of the user's shopping cart.",
            "works": ["Worked in a team of 3 to complete a MERN application for CSIS3380 Full Stack Development with JavaScript",
                    "Developed routes and related components in the React frontend",
                    "Designed and implemented UI with CSS",
                    "Created local JSON file with 30 meals' details for data fetching"],
            "technologies": "HTML, CSS, JavaScript, React.js, Express.js, Node.js, MongoDB"
        }
    ]
}
