{
    "projects": [
        {
            "id": 1,
            "name": "AskAiden",
            "url": "https://ask-aiden-ui.vercel.app/",
            "image": "https://s3.us-west-2.amazonaws.com/kendicey.io/askaiden.png",
            "description": "Responsive web app to address accessibility challenges and empower those who are not tech-savvy to effortlessly harness the power of AI. Recognizing the difficulties individuals face in effectively communicating with ChatGPT, especially when it comes to writing suitable prompts, Aiden, the friendly whale, offers invaluable assistance in your interactions with ChatGPT. With Aiden's support, users can create effective prompts and customize answer styles for remarkable results!",
            "works": ["Worked in a team of two developers and a UI/UX designer to build an AI-driven educational search website",
                    "Followed a UI designer's high fidelity prototype o Figma to build the frontend with TypeScript, React.js and MaterialUI",
                    "Established the backend API connection using Python with FastAPI and the OpenAI API",
                    "Configured project's Lambda function on AWS"],
            "technologies": ["react", "materialui", "typescript", "html", "css", "fastapi", "openai", "lambda"]
        },
        {
            "id": 2,
            "name": "KidsPedia",
            "url": "https://devpost.com/software/kidspedia",
            "image": "https://github.com/HSKPeter/KidsPedia/blob/main/docs/screenshot.png?raw=true",
            "description": "Leveraging on the ChatGPT technology of OpenAI, KidsPedia provides simple and easy-to-understand answers with metaphors to kids' questions. From apples to theory of relativity, KidsPedia explains them all! To enhance searching experiences, KidsPedia includes a read-out function to read out the answers to kids' questions. To speed up the search process, KidsPedia also stores search records in a database.",
            "works": ["Worked in a team of 2 to complete a web application within 24 hours in the nwHacks 2023 hackathon",
                    "Developed backend environment with Express.js and the OpenAI API",
                    "Worked on the frontend using React.js"],
            "technologies": ["react", "javascript", "express", "openai", "postgresql", "azure", "docker"]
        },
        {
            "id": 3,
            "name": "3380 Prairie Sky Café Online Ordering System",
            "url": "https://github.com/BenTsui2023/csis3380-final-project",
            "image": "https://github.com/BenTsui2023/csis3380-final-project/blob/main/doc/project_preview.png?raw=true",
            "description": "This project entails a MERN application designed specifically for 3380 Prairie Sky Cafe, where users are able to register an account and place orders. The system is also capable of keeping track of the user's shopping cart.",
            "works": ["Worked in a team of 3 to complete a MERN application for CSIS3380 Full Stack Development with JavaScript",
                    "Developed routes and related components in the React frontend",
                    "Designed and implemented UI with CSS",
                    "Created local JSON file with 30 meals' details for data fetching",
                    "Selected as one of the top three projects in the class."],
            "technologies": ["html", "css", "javascript", "react", "express", "node", "mongodb"]
        },
        {
            "id": 4,
            "name": "Daily Mood Playlist Generator",
            "url": "https://github.com/elise-green/cmd-f-hackathon-2023",
            "image": "https://s3.us-west-2.amazonaws.com/kendicey.io/cmd_preview.png",
            "description": "A web app let user answer the question 'How was your day today?' and returns a spotify playlist that matches user's mood.",
            "works": ["Worked in a team of 4 to complete a web application in cmd-f 2023 hackathon",
                    "Developed backend with Express.js and Cohere AI's Classify API",
                    "Built connection between React frontend and Express.js backend"],
            "technologies": ["react", "express", "cohere"]
        },
        {
            "id": 5,
            "name": "Recycle Star",
            "url": "https://devpost.com/software/recycle-star",
            "image": "https://github.com/kendicey/Recycle-Star/blob/main/docs/preview.png?raw=true",
            "description": "Recognizing the difficulties many newcomers face in understanding the recycling system and the disparities between their home countries and Canada, Recycle Star aims to provide a user-friendly and interactive website that serves as a comprehensive resource, addressing the specific needs of newcomers. To ensure accessibility for users with color blindness, Recycle Star has been thoughtfully designed with color-blind-friendly colors.",
            "works": ["Worked in a team of 3 to build a website within 48 hours in WaffleHacks 2023",
                    "Followed designers' Figma design to code the website will HTML, CSS, Bootstrap, and JavaScript",
                    "Designed and built the 'Recycle Mission' mini game using JavaScript and HTML Drag-and-Drop API"],
            "technologies": ["html", "css", "bootstrap", "javascript"]
        },
        {
            "id": 6,
            "name": "Mark Six Lottery Numbers Generator",
            "url": "https://github.com/kendicey/mark-six-lottery-numbers-generator-REACT",
            "image": "https://github.com/kendicey/mark-six-lottery-numbers-generator-REACT/blob/main/docs/preview.png?raw=true",
            "description": "This project is a Mark Six lottery number generator, designed to assist players in generating 6 unique numbers for the popular game organized by the Hong Kong Jockey Club. Inspired by my mom's frequent requests for lucky numbers, I created this program to empower her to generate numbers independently. With this tool, players can easily and quickly generate their own sets of numbers for the Mark Six lottery game.",
            "works": ["Built a website to generate numbers for a Hong Kong lottery game with HTML, CSS, JavaScript, and React.js",
                    "Designed user interface and implemented responsive design with CSS",
                    "Deployed website with Vercel"],
            "technologies": ["react", "javascript", "html", "css"]
        }
    ]
}
